Cauchy/Thermowell/fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Thermowell
    {
        type            patch;
        physicalType    patch;
        nFaces          108;
        startFace       13096;
    }
    Inside
    {
        type            patch;
        physicalType    patch;
        nFaces          80;
        startFace       13204;
    }
    Bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          84;
        startFace       13284;
    }
    defaultFaces
    {
        type            patch;
        nFaces          1920;
        startFace       13368;
    }
)

// ************************************************************************* //
