Cauchy/Thermowell/fine/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    PipeWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
11070
(
29.4564
29.4564
29.4564
29.4564
29.4564
29.4564
29.4564
29.4564
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylinderwalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
6284
(
2.0548
6.43862
2.19695
2.07075
6.10997
4.67889
4.16948
3.94405
...
)
;
    }
}


// ************************************************************************* //
